let mesto = ['Я','Ты','Мы','Они','Он','Она','Это'];
let yesNo = ['',' ','не'];
let end = ['.','.','?'];
let verb = {
  
  ask: {
    past:   ["спрашивал","спрашивал","спрашивали","спрашивали","спрашивал","спрашивала","спрашивало"],
    pres:   ["спрашиваю","спрашиваешь","спрашиваем","спрашивают","спрашивает","спрашивает","спрашивает"],
    futur:  ["спрошу","спросишь","спросим","спросят","спросит","спросит","спросит"]
  },
  go: {
    past:   ["шел","шел","шли","шли","шел","шла","шло"], 
    pres:   ["иду","идешь","идем","идут","идет","идет","идет"], 
    futur:  ["пойду","пойдешь","пойдем","пойдут","пойдет","пойдет","пойдет"],
  },
  sleep: {
    past:   ["спал","спал","спали","спали","спал","спала","спало"], 
    pres:   ["сплю","спишь","спим","спят","спит","спит","спит"], 
    futur:  ["посплю","поспишь","поспим","поспят","поспит","поспит","поспит"],
  },
  think: {
    past:   ["думал","думал","думали","думали","думал","думала","думало"], 
    pres:   ["думаю","думаешь","думаем","думают","думает","думает","думает"], 
    futur:  ["подумаю","подумаешь","подумаем","подумают","подумает","подумает","подумает"],
  },
  love: {
    past:   ["любил","любил","любили","любили","любил","любила","любило"],
    pres:   ["люблю","любишь","любим","любят","любит","любит","любит"],
    futur:  ["полюблю","полюбишь","полюбим","полюбят","полюбит","полюбит","полюбит"]
  },
  work: {
    past:   ["работал","работал","работали","работали","работал","работала","работало"],
    pres:   ["работаю","работаешь","работаем","работают","работает","работает","работает"],
    futur:  ["поработаю","поработаешь","поработаем","поработают","поработает","поработает","поработает"]
  },
  call: {
    past:   ["звонил","звонил","звонили","звонили","звонил","звонила","звонило"],
    pres:   ["звоню","звонишь","звоним","звонят","звонит","звонит","звонит"],
    futur:  ["позвоню","позвонишь","позвоним","позвонят","позвонит","позвонит","позвонит"]
  },
  try: {
    past:   ["пробовал","пробовал","пробовали","пробовали","пробовал","пробовала","пробовало"],
    pres:   ["пробую","пробуешь","пробуем","пробуют","пробует","пробует","пробует"],
    futur:  ["попробую","попробуешь","попробуем","попробуют","попробует","попробует","попробует"]
  },
  need: {
    past:   ["нуждался","нуждался","нуждались","нуждались","нуждался","нуждалась","нуждалось"],
    pres:   ["нуждаюсь","нуждаешься","нуждаемся","нуждаются","нуждается","нуждается","нуждается"],
    futur:  ["буду нуждаться","будешь нуждаться","будем нуждаться","будут нуждаться","будет нуждаться","будет нуждаться","будет нуждаться"]
},
  want: {
    past:   ["хотел","хотел","хотели","хотели","хотел","хотела","хотело"],
    pres:   ["хочу","хочешь","хотим","хотят","хочет","хочет","хочет"],
    futur:  ["захочу","захочешь","захотим","захотят","захочет","захочет","захочет"]
  },
  look: {
    past:   ["смотрел","смотрел","смотрели","смотрели","смотрел","смотрела","смотрело"],
    pres:   ["смотрю","смотришь","смотрим","смотрят","смотрит","смотрит","смотрит"],
    futur:  ["посмотрю","посмотришь","посмотрим","посмотрят","посмотрит","посмотрит","посмотрит"]
  },
  use: {
    past:   ["пользовался","пользовался","пользовались","пользовались","пользовался","пользовалась","пользовалось"],
    pres:   ["пользуюсь","пользуешься","пользуемся","пользуются","пользуется","пользуется","пользуется"],
    futur:  ["буду пользоваться","будешь пользоваться","будем пользоваться","будут пользоваться","будет пользоваться","будет пользоваться","будет пользоваться"]
},
  help: {
    past:   ["помогал","помогал","помогали","помогали","помогал","помогала","помогало"],
    pres:   ["помогаю","помогаешь","помогаем","помогают","помогает","помогает","помогает"],
    futur:  ["помогу","поможешь","поможем","помогут","поможет","поможет","поможет"]
  },
  live: {
    past:   ["жил","жил","жили","жили","жил","жила","жило"],
    pres:   ["живу","живёшь","живём","живут","живёт","живёт","живёт"],
    futur:  ["поживу","поживёшь","поживём","поживут","поживёт","поживёт","поживёт"]
  },
  start: {
    past:   ["начинал","начинал","начинали","начинали","начинал","начинала","начинало"],
    pres:   ["начинаю","начинаешь","начинаем","начинают","начинает","начинает","начинает"],
    futur:  ["начну","начнёшь","начнём","начнут","начнёт","начнёт","начнёт"]
  },
  finish: {
    past:   ["заканчивал","заканчивал","заканчивали","заканчивали","заканчивал","заканчивала","заканчивало"],
    pres:   ["заканчиваю","заканчиваешь","заканчиваем","заканчивают","заканчивает","заканчивает","заканчивает"],
    futur:  ["закончу","закончишь","закончим","закончат","закончит","закончит","закончит"]
  },
  see: {
    past:   ["видел","видел","видели","видели","видел","видела","видело"],
    pres:   ["вижу","видишь","видим","видят","видит","видит","видит"],
    futur:  ["увижу","увидишь","увидим","увидят","увидит","увидит","увидит"]
  },
  come: {
    past:   ["приходил","приходил","приходили","приходили","приходил","приходила","приходило"],
    pres:   ["прихожу","приходишь","приходим","приходят","приходит","приходит","приходит"],
    futur:  ["приду","придёшь","придём","придут","придёт","придёт","придёт"]
  },
  know: {
    past:   ["знал","знал","знали","знали","знал","знала","знало"],
    pres:   ["знаю","знаешь","знаем","знают","знает","знает","знает"],
    futur:  ["узнАю","узнАешь","узнАем","узнАют","узнАет","узнАет","узнАет"]
  },
  make: {
    past:   ["делал","делал","делали","делали","делал","делала","делало"],
    pres:   ["делаю","делаешь","делаем","делают","делает","делает","делает"],
    futur:  ["сделаю","сделаешь","сделаем","сделают","сделает","сделает","сделает"]
  },
}

function rnd(mas) {
  let i = Math.random() * mas.length;
  return Math.floor(i);
}

function generate() {
  let step1 = rnd(mesto);
  let step2 = rnd(yesNo);
  let step3 = Math.floor(Math.random() * Object.keys(verb).length); // генерируем номер глагола из объекта
  let step4 = Math.floor(Math.random() * 3); // прошедшее, настоящее, будущее
  let step5 = rnd(end);

  div.innerHTML = 
    mesto[step1] + ' ' + yesNo[step2] + " " + Object.values(Object.values(verb)[step3])[step4][step1] + end[step5];
}

function view() {
  over.classList.toggle('view');
}

let div = document.createElement('div');
div.className = 'frase';
document.body.prepend(div);
generate();

let over = document.querySelector('.over');